{
    "presentationHi": "Hola,",
    "presentationIam": "Soy",
    "presentationProfession": "Desarrollador Full Stack especializado en Backend",

    
    "aboutMeBg": "S",
    "aboutMeTitle" : "Sobre mi",
    "aboutMeItem1": "Tercer Puesto en la Comunity Fest and Code 2021",
    "aboutMeItem2": "Actualmente estudio Ingeniería Informática y resido en Cali, Colombia.",
    "aboutMeResume1": "Soy desarrollador con más de 9 años de experiencia en SQL y más de 4 en desarrollo de software, apasionado por el crecimiento continuo bajo la filosofía Kaizen. A lo largo de mi carrera, he liderado proyectos completos, enfocado en crear soluciones eficientes y escalables, tanto en entornos corporativos como en proyectos freelance.",
    "aboutMeResume2": "Tengo una sólida base en metodologías ágiles, especialmente SCRUM, y he trabajado con tecnologías como PHP (Laravel), JavaScript (Angular, React, Vue, Node), SQL (PostgreSQL, MySQL, SQL Server), MongoDB, C# (.NET), Ruby (Ruby on Rails), y Java (SpringBoot). Además, domino arquitecturas modernas, patrones de diseño y herramientas clave como AWS, Docker, Kubernetes, y Gitflow. Poseo un nivel de inglés B2, lo cual facilita la colaboración en equipos internacionales.",
    "aboutMeResume3": "Mi dedicación al aprendizaje continuo y al trabajo en equipo se reflejó en la competencia Community Fest and Code 2021, donde, junto a mi equipo, desarrollamos un proyecto en Angular que resultó ganador. Esta experiencia reafirma mi compromiso con la innovación y la mejora constante. Estoy entusiasmado por seguir contribuyendo y creciendo en equipos dinámicos y ambiciosos.",
    "aboutMeResume4": "Me enorgullece mantenerme a la vanguardia de las últimas tecnologías y estoy comprometido con el desarrollo continuo. Siendo un apasionado del pensamiento crítico, estoy seguro de que mi experiencia y habilidades contribuirán significativamente a cualquier proyecto que aborde. Estoy emocionado por la oportunidad de seguir creciendo y aportando a equipos dinámicos y ambiciosos.",
    "aboutMePrhase": "La verdadera sabiduría es saber que nunca dejas de aprender.",
   
   
    "educationBg": "E",
    "educationTitle": "Educación",
    "educationDescription": "Mi formación en el área tecnológica ha sido principalmente autodidacta, complementada por cursos certificados en lenguajes específicos y una sólida base académica con estudios técnicos y una Ingeniería Informática en curso. Esta profesión exige mantenerse actualizado constantemente, y es algo que abrazo con entusiasmo. La curiosidad y el compromiso con el aprendizaje continuo me impulsan a mantenerme al día con las últimas tendencias y herramientas.",
    
    "educationTitle0": "TÉCNICO EN SISTEMAS",
    "educationEnterprise0": "Sena",
    "educationDescription0": "Este programa fue mi primer acercamiento a la programación, donde aprendí sobre la arquitectura de computadores y di mis primeros pasos en el desarrollo de software. Fue una base fundamental que despertó mi interés por profundizar en el campo tecnológico.",
    "educationYear0": "2012 - 2013",
    
    "educationTitle1": "MINTIC 2022",
    "educationEnterprise1": "Universidad Pontifice Bolivariana de Medellin",
    "educationDescription1": "Acepté esta ruta de aprendizaje para profundizar en nuevas tecnologías y lenguajes de programación, enfrentándome a desafíos diversos que fortalecieron mis habilidades y ampliaron mi perspectiva en el desarrollo de software.",
    "educationYear1": "2021 - 2022",

    "educationTitle2": "INGENIERIA INFORMÁTICA",
    "educationEnterprise2": "Universidad de Cataluña",
    "educationDescription2": "Actualmente estoy cursando esta carrera, lo que me ha permitido homologar conocimientos previos y consolidar una base académica que complementa mi experiencia práctica.",
    "educationYear2": "2024 - 2026",
    
    "educationTitle3": "EDUCACION AUTODIDACTA",
    "educationEnterprise3": "Udemy, Sena, Coursera, etc",
    "educationDescription3": "Mi formación autodidacta ha sido un pilar fundamental en mi crecimiento como desarrollador. Esta trayectoria me ha permitido explorar y dominar un amplio rango de conocimientos esenciales para el desarrollo de software moderno. Desde lenguajes de programación como Java, C#, JavaScript, PHP, Ruby, hasta patrones de diseño, arquitecturas de software (microservicios, hexagonal, SOA) y metodologías ágiles como SCRUM. Además, he profundizado en tecnologías clave de la nube, como AWS y GCP, y herramientas modernas como Docker y Kubernetes. Cada nueva herramienta o tecnología aprendida representa para mí no solo un desafío superado, sino también una oportunidad para evolucionar. Esta constante búsqueda de conocimiento, impulsada por mi pasión por el aprendizaje continuo, refleja mi compromiso con la excelencia profesional y mi filosofía Kaizen: mejorar cada día para aportar soluciones más innovadoras y efectivas.",
    "educationYear3": "-",

    
    "technologiesBg": "T",
    "technologiesTitle": "Tecnologias",
    "technologiesDescription": "A lo largo de mi carrera, en los diferentes proyectos y retos, he adquirido una valiosa experiencia que ha fortalecido mis habilidades y conocimientos. Este recorrido ha sido un aprendizaje continuo, en el que he enfrentado diversos desafíos que me han impulsado a explorar y dominar una amplia gama de tecnologías y lenguajes. Me ha demostrado que, sin importar el reto, siempre es posible superarlo. A continuación, presento algunas de las tecnologías con las que he trabajado.",
    
    "technologyIcon0": "java.png",
    "technologyIconName0": "Java",
    "technologyIcon1": "springboot.png",
    "technologyIconName1": "Spring boot",
    "technologyIcon2": "webflux.png",
    "technologyIconName2": "Webflux",
    "technologyIcon3": "kafka.png",
    "technologyIconName3": "Kafka",
    "technologyIcon4": "php.png",
    "technologyIconName4": "Php",
    "technologyIcon5": "laravel.png",
    "technologyIconName5": "Laravel",
    "technologyIcon6": "python.png",
    "technologyIconName6": "Python",
    "technologyIcon7": "ruby.png",
    "technologyIconName7": "Ruby",
    "technologyIcon8": "rails.png",
    "technologyIconName8": "Ruby on Rails",
    "technologyIcon9": "csharp.png",
    "technologyIconName9": "C#",
    "technologyIcon10": "dotnet.png",
    "technologyIconName10": ".NET",
    "technologyIcon11": "js.png",
    "technologyIconName11": "Javascript",
    "technologyIcon12": "typescript.png",
    "technologyIconName12": "typescript",
    "technologyIcon13": "angular.png",
    "technologyIconName13": "Angular",
    "technologyIcon14": "react.png",
    "technologyIconName14": "React",
    "technologyIcon15": "vue.png",
    "technologyIconName15": "Vue",
    "technologyIcon16": "nodejs.png",
    "technologyIconName16": "NodeJS",
    "technologyIcon17": "sql.png",
    "technologyIconName17": "SQL",
    "technologyIcon18": "mysql.png",
    "technologyIconName18": "MySQL",
    "technologyIcon19": "pgsql.png",
    "technologyIconName19": "PostgreSQL",
    "technologyIcon20": "sqlserver.png",
    "technologyIconName20": "sqlserver",
    "technologyIcon21": "mongodb.png",
    "technologyIconName21": "MongoDB",
    "technologyIcon22": "aws.png",
    "technologyIconName22": "AWS",
    "technologyIcon23": "gcp.png",
    "technologyIconName23": "Google Cloud platform",
    "technologyIcon24": "docker.png",
    "technologyIconName24": "Docker",
    "technologyIcon25": "git.png",
    "technologyIconName25": "Git",
    "technologyIcon26": "jenkins.png",
    "technologyIconName26": "Jenkins",
    "technologyIcon27": "linux.png",
    "technologyIconName27": "Linux",

    
    "skillsBg": "H",
    "skillsTitle": "Habilidades",
    "skillsDescription": "Las habilidades son clave en el desarrollo personal y profesional. A lo largo de mi carrera, he logrado fortalecer y adquirir nuevas habilidades gracias a la disciplina, la perseverancia y mi enfoque en el aprendizaje continuo. Mi experiencia práctica y la educación autodidacta me han permitido adaptarme a diferentes desafíos y evolucionar constantemente. Creo que un conjunto de habilidades bien desarrollado no solo es esencial para cumplir metas y superar retos, sino que también puede generar un impacto positivo en la sociedad al ofrecer soluciones innovadoras y efectivas.",
   
    "skillList0": "Habilidades Técnicas",
    "skillDescription0": "A lo largo de mi carrera, he trabajado con diversas tecnologías y lenguajes, dominando herramientas clave para desarrollar soluciones escalables y eficientes. He diseñado arquitecturas de software robustas, implementado patrones de diseño, y aplicado principios SOLID para mantener el código limpio y bien estructurado. Además, cuento con experiencia en la automatización de tareas repetitivas y la integración de sistemas y microservicios, lo que me permite crear aplicaciones y soluciones que cumplen con los más altos estándares de calidad.",
    "skillList1": "Metodologías Ágiles",
    "skillDescription1": "En proyectos ágiles, he liderado equipos utilizando metodologías como SCRUM y Kanban para lograr una entrega continua de valor. Me he especializado en la gestión de equipos multidisciplinarios, asegurando la colaboración eficaz, y en la mentoría de desarrolladores junior, lo cual ha sido clave para el desarrollo y éxito de cada proyecto.",
    "skillList2": "Habilidades Interpersonales y de Comunicación",
    "skillDescription2": "Mi capacidad para comunicarme de manera efectiva ha sido esencial en cada fase de mi carrera. Soy capaz de presentar ideas complejas de manera clara tanto a equipos técnicos como no técnicos. Además, me he especializado en la toma de decisiones informadas, la negociación de soluciones y la resolución de conflictos, lo que favorece un ambiente de trabajo colaborativo y eficiente.",
    "skillList3": "Habilidades de Gestión y Liderazgo",
    "skillDescription3": "Mi enfoque en la gestión y liderazgo me ha permitido dirigir equipos hacia el logro de objetivos comunes, asegurando que los proyectos se completen a tiempo y dentro del presupuesto. La gestión de tiempo, la priorización y la toma de decisiones estratégicas han sido cruciales en mi carrera para alcanzar metas desafiantes y mantener altos estándares de calidad en el trabajo.",
    "skillList4": "Habilidades en Desarrollo Profesional",
    "skillDescription4": "El aprendizaje continuo y la evolución personal son parte fundamental de mi carrera. Siempre he apostado por mantenerme actualizado con las nuevas tecnologías y enfoques, lo que me ha permitido adaptarme rápidamente a los cambios en la industria. Mi capacidad para aprender de manera autodidacta ha sido crucial para mejorar y seguir desarrollándome como profesional.",


    "experienceBg": "E",
    "experienceTitle": "Experiencias empresariales",
    "experienceResume": "La experiencia son un conjunto de habilidades otorgadas por la suma entre el tiempo y la práctica.",
   
    "experienceYear0": "2015 - 2020",
    "experienceTitle0":"Administrador de Servidores / Bd",
    "experienceSubTitle0": "Grupo empresarial MR",
    "experienceDescription0":"Administración de servidores Windows, y sus respectivas bases de datos en MySQL, esto conlleva Backups y documentación y registro siguiendo el proceso documentado en los documentos internos. Reporte de datos de acuerdo con consultas realizadas con sus respectivos análisis de datos. Soporte a sistema interno mediante ssh y sus tarjetas electrónicas, mantenimiento preventivo y correctivo a las mismas. Mantenimiento preventivo y correctivo a equipos de cómputo. Registro, validación y presentación de datos (Gestión documental) en auditorias Administración de usuarios en los programas instalados y en aplicativos de la compañía. Gestión de usuarios de dominio. Administración y soporte a estructura de red. Actualizaciones al software interno escrito en java. Desarrollar aplicación para la gestión y automatización de telemercadeo.",
    "experienceTechnologies0": "MYSQL, Windows Server, Ubuntu server, php, javascript, Java.",
   
    "experienceYear1": "2021-2022",
    "experienceTitle1":"Desarrollador staff",
    "experienceSubTitle1": "Siesa",
    "experienceDescription1":"Desarrollar y solucionar inconvenientes relacionados con un software usado en diferentes clínicas de la costa colombiana, trabajando con una librería interna desarrollada en php y migrando la misma en C#, primer contacto con SQL Server y sus diferentes funciones almacenadas, desarrollando y optimizando ya creadas, manejando siempre un sistema o una plataforma de requerimientos interna cliente-soporte.",
    "experienceTechnologies1": "Php con un Framework interno, SQL SERVER, GIT(Sourcetree), Bitbucket, IIS, FASTREPORT, C#(.NET)",
   
    "experienceYear2": "2022",
    "experienceTitle2":"Desarrollador full stack",
    "experienceSubTitle2": "Spartan Hill",
    "experienceDescription2":"Desarrollar los diferentes requerimientos en una plataforma de criptomonedas llamada plutowallet la cual integrábamos servicios de binance y AWS, para el uso, estado de cuentas, transacciones y todo esto sobre las criptomonedas incluyendo su valor en el mercado incluyendo las fluctuaciones. Siempre usando la metodología SCRUM para gestionar y cumplir con los tiempos de desarrollo y su organización, en esta empresa recibí formación y certificación sobre la metodología SCRUM. Realizando soporte requeridos por los directores usando la metodología scrum. Creación de pagina web promocionando el Festival de Blockchain en el salvador, con su boletería, pasarela de pagos con la posibilidad de pagar por criptomonedas.",
    "experienceTechnologies2": "Javascript( Strapi, React, NodeJS, React Native), Mongo, Bitbucket.",
   
    "experienceYear3": "2022 - 2024",
    "experienceTitle3":"Desarrollador full stack",
    "experienceSubTitle3": "Punto Red",
    "experienceDescription3":"Integraciones de servicios bancarios externos con productos internos por medio del ISO 8583 y Api Rest, Apificaciones (migraciones) de servicios de un producto a otro. Migración de api interna a diferentes microservicios. Automatizaciones de procesos por medio de Python, panda y otras herramientas para la ayuda de procesos internos. Desarrollo y Refactorización de código de servicios integrados con AWS la cual se debían implementar los principios SOLID para mejorar tiempos de su ejecución y a su vez limpiar el código. Desarrollar los diferentes requerimientos por medio de historias de usuarios o proyectos tanto en backend como frontend. Dirigir el desarrollo del frontend de un producto interno creado para autogestionar la inscripción de clientes con productos internos, basándonos en diseños UX/UI para que el frontend de la aplicación quede igual que el diseño y los requerimientos deseados.",
    "experienceTechnologies3": "Springboot, Bitbucket, Ruby on rails, Python, Vue 2 y 3, postgresql, Jenkins,  sonarqube, AWS.",
    
    
    "portfolioTitle": "Portafolio",
    "portfolioBg": "P",
    "portfolioDescription": "Proyectos trabajados de manera independiente",
    
    "portfolioEnterprise0": "AUREALAB",
    "portfolioName0": "ANT",
    "portfolioYears0": "2022",
    "portfolioDescription0": "Administracion y gestion de asesores.",

    "portfolioEnterprise1": "IMPROVEMENT AFO",
    "portfolioName1": "SINHANTB",
    "portfolioYears1": "2020",
    "portfolioDescription1": "Administracion y gestion de pacientes y enfermedades.",

    "portfolioEnterprise2": "IMPROVEMENT AFO",
    "portfolioName2": "INVENTARIO",
    "portfolioYears2": "2022",
    "portfolioDescription2": "Administracion y gestion de inventario.",

    "portfolioEnterprise3": "IMPROVEMENT AFO",
    "portfolioName3": "LINEA 106",
    "portfolioYears3": "2024",
    "portfolioDescription3": "Administracion y gestion de pacientes de la linea 106.",
    
    "portfolioEnterprise4": "AUREALAB",
    "portfolioName4": "ANT",
    "portfolioYears4": "2024",
    "portfolioDescription4": "Administracion y gestion de asesores.",
    
    "portfolioEnterprise5": "FORMULA 1",
    "portfolioName5": "GES",
    "portfolioYears5": "2022",
    "portfolioDescription5": "Administracion y gestion de instructores.",

    "projectDescription0": "Aplicativo web el cual administra y gestiona los asesores, asesorías, usuarios y reportes. Para Facilitar gestiones internas en el proceso administrativo.",
    "projectImg01": "src/assets/proyects/ant1.webp",
    "projectImg02": "src/assets/proyects/ant2.webp",
    "projectImg03": "src/assets/proyects/ant3.webp",
    "projectTechnologies0": "Laravel 7, Angular 9, PostgreSQL, GIT",
    
    "projectDescription1": "Aplicación usada a nivel departamental para la administración, gestión y seguimiento de pacientes, usuarios y convivientes, sus respectivos diagnósticos y tratamientos de enfermedades como: Lepra, Tuberculosis sensible, Tuberculosis farmacorresistente. El sistema genera diferentes reportes y tiene diferentes graficas un mapa de calor que cambia de acuerdo con la cantidad de pacientes por municipios",
    "projectImg11": "src/assets/proyects/Sinhantb1.webp",
    "projectImg12": "src/assets/proyects/Sinhantb2.webp",
    "projectImg13": "src/assets/proyects/Sinhantb3.webp",
    "projectTechnologies1": "Laravel 7, Angular 11, POSTGRESQL, GIT, Linux",
    
    "projectDescription2": "Aplicación para la gestión y administración de inventario, cotizaciones, ventas, usuarios y reportes de una distribuidora departamental a las diferentes farmacias del departamento del valle del cauca, con sus respectivos requerimientos propios.",
    "projectImg21": "src/assets/proyects/inventario1.webp",
    "projectImg22": "src/assets/proyects/inventario2.webp",
    "projectImg23": "src/assets/proyects/inventario3.webp",
    "projectTechnologies2": "Laravel 7, GIT, Linux, MYSQL, GIT, Docker.",
    
    "projectDescription3": "Aplicación departamental para la gestión de reportes, pacientes y registro de llamadas de la línea de suicidio.",
    "projectImg31": "src/assets/proyects/linea1061.webp",
    "projectImg32": "src/assets/proyects/linea1062.webp",
    "projectImg33": "src/assets/proyects/linea1063.webp",
    "projectTechnologies3": "React, node, GIT, Linux, PostgreSQL",
    
    "projectDescription4": "Se Reescribe el programa incluyendo módulos como recepción y un módulo de caja para facilitar y ordenar más procesos como el de telemercadeo, también se agregan reportes para agilizar el proceso contable y se utilizan turnos para ordenar el proceso de los clientes durante su estadía. Se habilita un módulo de ‘califícanos’ para conocer la experiencia de los clientes. El módulo de recepción se desarrolla en react native y es un modulo de solo ingreso y validación de clientes con la intención de que sean ellos mismos que ingresen sus datos y así se garantiza la correcta obtención de datos. Desarrolla notificaciones y recordatorios del estado de la revisión tecnicomecanica. De desarrolla reportes via correo electrónico a la gerencia de las empresas con el software adquirido de acuerdo a la información de caja diaria",
    "projectImg41": "src/assets/proyects/nant1.webp",
    "projectImg42": "src/assets/proyects/nant2.webp",
    "projectImg43": "src/assets/proyects/nant3.webp",
    "projectTechnologies4": "Laravel 11, angular 18, PostgreSQL, Git, React native, Java, Kafka.",
    
    "projectDescription5": "Proyecto para la gestión de Instructores y estudiantes, ingreso y salida, siendo esta evidenciada por registro fotográfico con java y su correspondiente módulo de administración web para la gestión de Instructores, Encuestas, vehículos, mantenimientos y elementos de la escuela de conducción.",
    "projectImg51": "src/assets/proyects/ges1.webp",
    "projectImg52": "src/assets/proyects/ges2.webp",
    "projectImg53": "src/assets/proyects/ges3.webp",
    "projectTechnologies5": "Laravel, angular PostgreSQL, Git, Java",
    
    
    "interestsTitle": "Interests",
    "interestsBg": "I",
    "interestsDescription": "Nuestros gustos, carácter y filosofía en la que basamos nuestros actos definen quienes somos.",
    
    "interestsName1": "Aprender",
    "interestsItem1": "Aprender nuevas tecnologias",
    "interestsName2": "Retos",
    "interestsItem2": "Los retos son fundamentales en el crecimiento de una persona",
    "interestsName3": "Aportar",
    "interestsItem3": "Encajar con un buen equipo y aportar no solo al proyecto sino tambien a mis compañeros es muy valioso",


    "hobbiesBg": "H",
    "hobbiesTitle": "Hobbies",
    "hobbiesDescription": "Nuestros gustos, carácter y filosofía en la que basamos nuestros actos definen quienes somos.",
    
    "hobbiesName1": "Aprender",
    "hobbiesItem1": "Aprender nuevas tecnologias",
    "hobbiesName2": "Retos",
    "hobbiesItem2": "Los retos son fundamentales en el crecimiento de una persona",
    "hobbiesName3": "Aportar",
    "hobbiesItem3": "Encajar con un buen equipo y aportar no solo al proyecto sino tambien a mis compañeros es muy valioso",

    
    "contactMeBg": "C",
    "contactMeTitle": "ContactMe",

    "phoneNumber": "PhoneNumber",
    "email": "Email",
    "sena": "Sena",
    "upbm": "Universidad Pontifice Bolivariana de Medellin",
    "uc": "Universidad de Cataluña",
    "technologies": "Tecnologias usadas: ",
    "closeButton": "Cerrar",
    "switchLanguajeButton": "English",
    "curriculumVitaeButton": "Hoja de Vida"
}